export const AREAS: Record<string, string[]> = {
  "北海道": [
    "札幌市", "旭川市", "函館市", "釧路市", "苫小牧市", "帯広市", "小樽市", "北見市",
    "江別市", "千歳市", "岩見沢市", "恵庭市", "室蘭市", "石狩市", "登別市", "北広島市",
    "滝川市", "網走市", "稚内市", "紋別市",
  ],
  "青森県": [
    "青森市", "八戸市", "弘前市", "十和田市", "むつ市", "五所川原市", "三沢市",
    "黒石市", "つがる市", "平川市",
  ],
  "岩手県": [
    "盛岡市", "一関市", "奥州市", "花巻市", "北上市", "宮古市", "大船渡市",
    "釜石市", "久慈市", "滝沢市",
  ],
  "宮城県": [
    "仙台市", "石巻市", "大崎市", "名取市", "登米市", "栗原市", "気仙沼市",
    "多賀城市", "塩竈市", "富谷市", "岩沼市", "東松島市", "柴田町", "利府町",
  ],
  "秋田県": [
    "秋田市", "横手市", "大仙市", "由利本荘市", "大館市", "能代市", "湯沢市",
    "北秋田市", "潟上市", "鹿角市",
  ],
  "山形県": [
    "山形市", "鶴岡市", "酒田市", "米沢市", "天童市", "東根市", "寒河江市",
    "新庄市", "南陽市", "上山市",
  ],
  "福島県": [
    "福島市", "郡山市", "いわき市", "会津若松市", "須賀川市", "白河市", "二本松市",
    "南相馬市", "伊達市", "喜多方市", "本宮市", "田村市",
  ],
  "茨城県": [
    "水戸市", "つくば市", "日立市", "ひたちなか市", "古河市", "土浦市", "取手市",
    "筑西市", "神栖市", "牛久市", "龍ケ崎市", "笠間市", "石岡市", "鹿嶋市", "守谷市",
  ],
  "栃木県": [
    "宇都宮市", "小山市", "栃木市", "足利市", "佐野市", "那須塩原市", "鹿沼市",
    "日光市", "真岡市", "大田原市", "下野市",
  ],
  "群馬県": [
    "前橋市", "高崎市", "太田市", "伊勢崎市", "桐生市", "渋川市", "館林市",
    "藤岡市", "安中市", "富岡市", "沼田市", "みどり市",
  ],
  "埼玉県": [
    "さいたま市", "川口市", "川越市", "所沢市", "越谷市", "草加市", "春日部市",
    "上尾市", "熊谷市", "新座市", "狭山市", "久喜市", "入間市", "深谷市", "三郷市",
    "朝霞市", "戸田市", "鴻巣市", "加須市", "富士見市",
  ],
  "千葉県": [
    "千葉市", "船橋市", "松戸市", "市川市", "柏市", "市原市", "八千代市",
    "流山市", "佐倉市", "習志野市", "浦安市", "野田市", "木更津市", "我孫子市",
    "成田市", "鎌ケ谷市", "印西市", "茂原市", "君津市",
  ],
  "東京都": [
    "千代田区", "中央区", "港区", "新宿区", "文京区", "台東区", "墨田区", "江東区",
    "品川区", "目黒区", "大田区", "世田谷区", "渋谷区", "中野区", "杉並区", "豊島区",
    "北区", "荒川区", "板橋区", "練馬区", "足立区", "葛飾区", "江戸川区",
    "八王子市", "立川市", "武蔵野市", "三鷹市", "府中市", "調布市", "町田市",
    "日野市", "国分寺市", "西東京市", "小平市", "東村山市", "多摩市", "国立市",
  ],
  "神奈川県": [
    "横浜市", "川崎市", "相模原市", "藤沢市", "横須賀市", "平塚市", "茅ヶ崎市",
    "厚木市", "大和市", "海老名市", "小田原市", "座間市", "秦野市", "伊勢原市",
    "鎌倉市", "綾瀬市", "逗子市", "三浦市", "南足柄市",
  ],
  "新潟県": [
    "新潟市", "長岡市", "上越市", "三条市", "新発田市", "柏崎市", "燕市",
    "村上市", "南魚沼市", "佐渡市", "十日町市", "五泉市",
  ],
  "富山県": [
    "富山市", "高岡市", "射水市", "南砺市", "氷見市", "砺波市", "黒部市",
    "小矢部市", "滑川市", "魚津市",
  ],
  "石川県": [
    "金沢市", "白山市", "小松市", "加賀市", "七尾市", "野々市市", "かほく市",
    "能美市", "輪島市", "羽咋市",
  ],
  "福井県": [
    "福井市", "坂井市", "越前市", "鯖江市", "敦賀市", "大野市", "小浜市",
    "あわら市", "勝山市",
  ],
  "山梨県": [
    "甲府市", "甲斐市", "南アルプス市", "笛吹市", "富士吉田市", "北杜市",
    "山梨市", "都留市", "韮崎市", "中央市",
  ],
  "長野県": [
    "長野市", "松本市", "上田市", "飯田市", "佐久市", "安曇野市", "伊那市",
    "塩尻市", "千曲市", "茅野市", "諏訪市", "須坂市", "岡谷市",
  ],
  "岐阜県": [
    "岐阜市", "大垣市", "各務原市", "多治見市", "可児市", "高山市", "関市",
    "中津川市", "羽島市", "土岐市", "美濃加茂市", "恵那市", "瑞浪市",
  ],
  "静岡県": [
    "静岡市", "浜松市", "富士市", "沼津市", "磐田市", "藤枝市", "焼津市",
    "富士宮市", "掛川市", "三島市", "島田市", "袋井市", "御殿場市", "裾野市",
    "湖西市",
  ],
  "愛知県": [
    "名古屋市", "豊田市", "岡崎市", "一宮市", "豊橋市", "春日井市", "安城市",
    "豊川市", "西尾市", "刈谷市", "小牧市", "稲沢市", "瀬戸市", "半田市",
    "東海市", "江南市", "大府市", "日進市", "あま市", "知多市",
  ],
  "三重県": [
    "津市", "四日市市", "鈴鹿市", "松阪市", "桑名市", "伊勢市", "名張市",
    "伊賀市", "亀山市", "志摩市", "いなべ市",
  ],
  "滋賀県": [
    "大津市", "草津市", "長浜市", "東近江市", "彦根市", "甲賀市", "近江八幡市",
    "守山市", "栗東市", "湖南市", "野洲市",
  ],
  "京都府": [
    "京都市", "宇治市", "亀岡市", "舞鶴市", "城陽市", "長岡京市", "福知山市",
    "木津川市", "京田辺市", "八幡市", "向日市", "大山崎町", "精華町",
  ],
  "大阪府": [
    "大阪市", "堺市", "東大阪市", "枚方市", "豊中市", "吹田市", "高槻市",
    "茨木市", "八尾市", "寝屋川市", "岸和田市", "守口市", "門真市", "松原市",
    "大東市", "和泉市", "箕面市", "羽曳野市", "摂津市", "藤井寺市", "泉大津市",
    "富田林市", "河内長野市", "池田市", "交野市", "柏原市", "泉佐野市", "貝塚市",
    "高石市",
  ],
  "兵庫県": [
    "神戸市", "姫路市", "西宮市", "尼崎市", "明石市", "加古川市", "宝塚市",
    "伊丹市", "川西市", "三田市", "芦屋市", "高砂市", "豊岡市", "たつの市",
    "赤穂市", "洲本市", "三木市", "小野市",
  ],
  "奈良県": [
    "奈良市", "橿原市", "生駒市", "大和郡山市", "香芝市", "天理市", "大和高田市",
    "桜井市", "葛城市", "五條市", "御所市",
  ],
  "和歌山県": [
    "和歌山市", "田辺市", "橋本市", "紀の川市", "岩出市", "海南市", "新宮市",
    "有田市", "御坊市",
  ],
  "鳥取県": [
    "鳥取市", "米子市", "倉吉市", "境港市", "岩美町", "湯梨浜町",
  ],
  "島根県": [
    "松江市", "出雲市", "浜田市", "益田市", "大田市", "安来市", "雲南市",
  ],
  "岡山県": [
    "岡山市", "倉敷市", "津山市", "総社市", "玉野市", "笠岡市", "井原市",
    "赤磐市", "備前市", "瀬戸内市", "真庭市",
  ],
  "広島県": [
    "広島市", "福山市", "呉市", "東広島市", "尾道市", "廿日市市", "三原市",
    "三次市", "大竹市", "竹原市", "庄原市", "府中市", "安芸高田市",
  ],
  "山口県": [
    "下関市", "山口市", "宇部市", "周南市", "岩国市", "防府市", "下松市",
    "光市", "萩市", "柳井市", "長門市",
  ],
  "徳島県": [
    "徳島市", "阿南市", "鳴門市", "吉野川市", "小松島市", "阿波市", "美馬市",
    "三好市",
  ],
  "香川県": [
    "高松市", "丸亀市", "三豊市", "観音寺市", "坂出市", "さぬき市", "善通寺市",
    "東かがわ市",
  ],
  "愛媛県": [
    "松山市", "今治市", "新居浜市", "西条市", "四国中央市", "大洲市", "宇和島市",
    "東温市", "伊予市", "西予市",
  ],
  "高知県": [
    "高知市", "南国市", "四万十市", "香南市", "土佐市", "須崎市", "宿毛市",
    "安芸市", "香美市",
  ],
  "福岡県": [
    "福岡市", "北九州市", "久留米市", "飯塚市", "大牟田市", "春日市", "筑紫野市",
    "大野城市", "宗像市", "太宰府市", "糸島市", "古賀市", "福津市", "行橋市",
    "朝倉市", "小郡市", "田川市", "直方市",
  ],
  "佐賀県": [
    "佐賀市", "唐津市", "鳥栖市", "伊万里市", "武雄市", "小城市", "嬉野市",
    "神埼市", "鹿島市",
  ],
  "長崎県": [
    "長崎市", "佐世保市", "諫早市", "大村市", "島原市", "南島原市", "雲仙市",
    "西海市", "五島市", "対馬市",
  ],
  "熊本県": [
    "熊本市", "八代市", "天草市", "玉名市", "宇城市", "合志市", "荒尾市",
    "山鹿市", "菊池市", "人吉市", "水俣市",
  ],
  "大分県": [
    "大分市", "別府市", "中津市", "佐伯市", "日田市", "宇佐市", "臼杵市",
    "豊後大野市", "杵築市", "国東市",
  ],
  "宮崎県": [
    "宮崎市", "都城市", "延岡市", "日向市", "日南市", "小林市", "西都市",
    "えびの市", "串間市",
  ],
  "鹿児島県": [
    "鹿児島市", "霧島市", "鹿屋市", "薩摩川内市", "姶良市", "出水市", "日置市",
    "奄美市", "指宿市", "曽於市", "南さつま市", "いちき串木野市",
  ],
  "沖縄県": [
    "那覇市", "沖縄市", "うるま市", "浦添市", "宜野湾市", "名護市", "豊見城市",
    "糸満市", "南城市", "石垣市", "宮古島市",
  ],
};
